Задание 1.
Релизовать Console.ReadLine через Console.Read

Тело функции - string CustomReadLine()


- Пример работы 

```
var s = CustomReadLine();// // Тут пользователь вводит текст, по нажатии Enter - работа ее завершается

Console.WriteLine(s); // то что ввел пользователь

```

Задание 2.
1. Написать программу, которая принимает целые числа для сложения
2. Программа должна выводить "введите первое число: ",
   в той же строке считывает целое число
3. Программа должна выводить "введите второе число: ",
   в той же строке считывает число
4. Введеные значения - складываем 
5. После этого выводим выражение в формате
	
	число1 + число2 = ответ


	Пример:


Результат сложения: 100 + 200 = 300




Задание 3. Со звездочкой:

Программа выводит первой строкой введенный текст с большой буквы
Второй строке обычный текст, перед эти выводя фиксированный

Чтобы из обычной буквы сделать большую, воспользуйтесь функцией char.ToUpper(char)

char.ToUpper('б')  => Б



Задание 4. C 2 звездочками

Есть функция Start - меню игры на стрелочках, нужно доделать ее таким образом, чтобы смена стрелочки
менялась без очистки экрана, т.е. воспользоваться GetCursorPosition





